In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
import matplotlib.pyplot as plt

In [7]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [8]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.067102  0.976972  0.716389  0.532053
2013-01-02  0.544194 -2.462507  0.167346 -2.367582
2013-01-03 -1.407481 -0.609476 -0.283144 -0.927019
2013-01-04  0.263740 -0.324537 -0.949796  1.330992
2013-01-05  1.809878 -0.003365  2.812199 -0.843661
2013-01-06 -0.200551 -1.622481  0.586260 -0.300397

In [10]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index = list(range(4)), dtype = 'float32'),
                    'D' : np.array([3] * 4, dtype = 'int32'),
                    'E' : pd.Categorical(["test", "train", "test", "train"]),
                    'F' : 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
#df2.<TAB>  주피터에서 사용 불가

In [13]:
df.head()

                   A         B         C         D
2013-01-01 -0.067102  0.976972  0.716389  0.532053
2013-01-02  0.544194 -2.462507  0.167346 -2.367582
2013-01-03 -1.407481 -0.609476 -0.283144 -0.927019
2013-01-04  0.263740 -0.324537 -0.949796  1.330992
2013-01-05  1.809878 -0.003365  2.812199 -0.843661

In [14]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.263740 -0.324537 -0.949796  1.330992
2013-01-05  1.809878 -0.003365  2.812199 -0.843661
2013-01-06 -0.200551 -1.622481  0.586260 -0.300397

In [15]:
df.tail()

                   A         B         C         D
2013-01-02  0.544194 -2.462507  0.167346 -2.367582
2013-01-03 -1.407481 -0.609476 -0.283144 -0.927019
2013-01-04  0.263740 -0.324537 -0.949796  1.330992
2013-01-05  1.809878 -0.003365  2.812199 -0.843661
2013-01-06 -0.200551 -1.622481  0.586260 -0.300397

In [16]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [18]:
df.values

array([[-0.06710178,  0.9769723 ,  0.71638878,  0.53205332],
       [ 0.54419393, -2.46250699,  0.16734636, -2.36758202],
       [-1.40748132, -0.60947563, -0.28314423, -0.92701864],
       [ 0.26374016, -0.32453653, -0.94979554,  1.33099203],
       [ 1.80987817, -0.00336518,  2.81219861, -0.84366143],
       [-0.20055088, -1.62248149,  0.5862597 , -0.3003967 ]])

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.157113 -0.674232  0.508209 -0.429269
std    1.050617  1.216563  1.282654  1.281858
min   -1.407481 -2.462507 -0.949796 -2.367582
25%   -0.167189 -1.369230 -0.170522 -0.906179
50%    0.098319 -0.467006  0.376803 -0.572029
75%    0.474080 -0.083658  0.683857  0.323941
max    1.809878  0.976972  2.812199  1.330992

In [20]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.067102    0.544194   -1.407481    0.263740    1.809878   -0.200551
B    0.976972   -2.462507   -0.609476   -0.324537   -0.003365   -1.622481
C    0.716389    0.167346   -0.283144   -0.949796    2.812199    0.586260
D    0.532053   -2.367582   -0.927019    1.330992   -0.843661   -0.300397

In [21]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01  0.532053  0.716389  0.976972 -0.067102
2013-01-02 -2.367582  0.167346 -2.462507  0.544194
2013-01-03 -0.927019 -0.283144 -0.609476 -1.407481
2013-01-04  1.330992 -0.949796 -0.324537  0.263740
2013-01-05 -0.843661  2.812199 -0.003365  1.809878
2013-01-06 -0.300397  0.586260 -1.622481 -0.200551

In [25]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-02  0.544194 -2.462507  0.167346 -2.367582
2013-01-06 -0.200551 -1.622481  0.586260 -0.300397
2013-01-03 -1.407481 -0.609476 -0.283144 -0.927019
2013-01-04  0.263740 -0.324537 -0.949796  1.330992
2013-01-05  1.809878 -0.003365  2.812199 -0.843661
2013-01-01 -0.067102  0.976972  0.716389  0.532053

In [26]:
df['A']

2013-01-01   -0.067102
2013-01-02    0.544194
2013-01-03   -1.407481
2013-01-04    0.263740
2013-01-05    1.809878
2013-01-06   -0.200551
Freq: D, Name: A, dtype: float64

In [27]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.067102  0.976972  0.716389  0.532053
2013-01-02  0.544194 -2.462507  0.167346 -2.367582
2013-01-03 -1.407481 -0.609476 -0.283144 -0.927019

In [28]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.544194 -2.462507  0.167346 -2.367582
2013-01-03 -1.407481 -0.609476 -0.283144 -0.927019
2013-01-04  0.263740 -0.324537 -0.949796  1.330992

In [29]:
df.loc[dates[0]]

A   -0.067102
B    0.976972
C    0.716389
D    0.532053
Name: 2013-01-01 00:00:00, dtype: float64

In [31]:
df.loc[:,['A','B','C']]

                   A         B         C
2013-01-01 -0.067102  0.976972  0.716389
2013-01-02  0.544194 -2.462507  0.167346
2013-01-03 -1.407481 -0.609476 -0.283144
2013-01-04  0.263740 -0.324537 -0.949796
2013-01-05  1.809878 -0.003365  2.812199
2013-01-06 -0.200551 -1.622481  0.586260

In [32]:
df.loc['20130102':'20130104', ['A','B']]

                   A         B
2013-01-02  0.544194 -2.462507
2013-01-03 -1.407481 -0.609476
2013-01-04  0.263740 -0.324537

In [33]:
df.loc['20130102',['A','B']]

A    0.544194
B   -2.462507
Name: 2013-01-02 00:00:00, dtype: float64

In [37]:
df.loc[dates[0],'A']

-0.06710178376717314

In [36]:
df.at[dates[0],'A']

-0.06710178376717314

In [38]:
df.iloc[3]

A    0.263740
B   -0.324537
C   -0.949796
D    1.330992
Name: 2013-01-04 00:00:00, dtype: float64

In [39]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.263740 -0.324537
2013-01-05  1.809878 -0.003365

In [40]:
df.iloc[0:2,0:2]

                   A         B
2013-01-01 -0.067102  0.976972
2013-01-02  0.544194 -2.462507

In [41]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.544194  0.167346
2013-01-03 -1.407481 -0.283144
2013-01-05  1.809878  2.812199

In [42]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.544194 -2.462507  0.167346 -2.367582
2013-01-03 -1.407481 -0.609476 -0.283144 -0.927019

In [43]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.976972  0.716389
2013-01-02 -2.462507  0.167346
2013-01-03 -0.609476 -0.283144
2013-01-04 -0.324537 -0.949796
2013-01-05 -0.003365  2.812199
2013-01-06 -1.622481  0.586260

In [44]:
df.iloc[1,1]

-2.4625069892238782

In [45]:
df.iloc[0,0]

-0.06710178376717314

In [46]:
df.iat[1,1]

-2.4625069892238782

In [50]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.544194 -2.462507  0.167346 -2.367582
2013-01-04  0.263740 -0.324537 -0.949796  1.330992
2013-01-05  1.809878 -0.003365  2.812199 -0.843661

In [51]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.976972  0.716389  0.532053
2013-01-02  0.544194       NaN  0.167346       NaN
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04  0.263740       NaN       NaN  1.330992
2013-01-05  1.809878       NaN  2.812199       NaN
2013-01-06       NaN       NaN  0.586260       NaN

In [52]:
df2 = df.copy()

In [53]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.067102  0.976972  0.716389  0.532053    one
2013-01-02  0.544194 -2.462507  0.167346 -2.367582    one
2013-01-03 -1.407481 -0.609476 -0.283144 -0.927019    two
2013-01-04  0.263740 -0.324537 -0.949796  1.330992  three
2013-01-05  1.809878 -0.003365  2.812199 -0.843661   four
2013-01-06 -0.200551 -1.622481  0.586260 -0.300397  three

In [54]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.407481 -0.609476 -0.283144 -0.927019   two
2013-01-05  1.809878 -0.003365  2.812199 -0.843661  four